In [1]:
#Q1.Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import  pandas as pd

In [3]:
data = [4,5,6,7,12,45]
series = pd.Series(data)

In [4]:
series

0     4
1     5
2     6
3     7
4    12
5    45
dtype: int64

In [5]:
#Q2.Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [6]:
data_list = [1,2,3,4,5,6,7,8,9,10]
list1 = pd.Series(data_list)

In [7]:
list1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [8]:
#Q3Create a Pandas DataFrame that contains the following data:
#name :- alice , bob , claire 
#age :- 25,30,27
#gender = female , male, female
#then , print the dataframe

In [11]:
data1 = {'name' : ['alica' , 'bob' , 'claire'],
        'Age': [25, 30, 27],
        'Gender' : ['female' , 'male' , 'female']}

df = pd.DataFrame(data1)

In [12]:
df

     name  Age  Gender
0   alica   25  female
1     bob   30    male
2  claire   27  female

In [13]:
#Q4What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
'''1). SERIES :-
            A Pandas Series is a one-dimensional labeled array capable of holding data of any type. 
It can be thought of as a single column of data, along with an index. Series is a basic building 
block of Pandas and can store homogeneous data types.'''

In [25]:
data2 = [23,22,21,20,19]
variable1 = pd.Series(data2)

In [26]:
variable1

0    23
1    22
2    21
3    20
4    19
dtype: int64

In [ ]:
'''2). DATAFRAME :-
           A Pandas DataFrame is a two-dimensional labeled data structure with columns
that can be of different data types. It can be thought of as a table, where each 
column is a Pandas Series. DataFrames are particularly useful for storing and 
manipulating structured data and are more versatile than Series. DataFrames can be created
from various data sources like lists, dictionaries, other Series, or
even from external sources like CSV files or databases.'''

In [27]:
dic1 = {'name' : ['varad' , 'darshan' , 'sakshi'],
       'age' : [22, 17 , 20],
       'gender': ['male' , 'male' , 'female']}

In [28]:
df1 = pd.DataFrame(dic1)

In [29]:
df1

      name  age  gender
0    varad   22    male
1  darshan   17    male
2   sakshi   20  female

In [30]:
#Q5What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [33]:
'''1. head(n) and tail(n)'''
print(df.head(2))

    name  Age  Gender
0  alica   25  female
1    bob   30    male

In [34]:
'''2. info()'''
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes
None

In [35]:
'''3. describe()'''
print(df.describe())

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [37]:
'''4. value_counts()'''
print(df['Gender'].value_counts())

female    2
male      1
Name: Gender, dtype: int64

In [38]:
'''5. groupby()'''
print(df.groupby('Gender')['Age'].mean())

Gender
female    26.0
male      30.0
Name: Age, dtype: float64

In [39]:
'''6. sort_values()'''
sorted_df = df.sort_values(by='Age', ascending=False)

In [40]:
sorted_df

     name  Age  Gender
1     bob   30    male
2  claire   27  female
0   alica   25  female

In [41]:
'''7. fillna()'''
df['Age'].fillna(df['Age'].mean(), inplace=True)

In [42]:
df

     name  Age  Gender
0   alica   25  female
1     bob   30    male
2  claire   27  female

In [43]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
'''In Pandas, both Series and DataFrame are mutable, meaning you can modify 
their values, add or remove elements, and perform various operations 
that change the content of the Series or DataFrame after they are created.
However, Panels are not mutable. Panels were a data structure in earlier 
versions of Pandas (before version 0.25) that allowed you to handle 3D data, 
but they have been removed from the latest versions of Pandas. Therefore,
as of recent versions of Pandas, Series and DataFrame are the primary mutable data structures.'''

In [44]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.

In [ ]:
names1 = pd.Series(['Alice', 'Bob', 'Claire'])
ages1 = pd.Series([25, 30, 27])
genders1 = pd.Series(['Female', 'Male', 'Female'])

data4 = {
    'Name': names1,
    'Age': ages1,
    'Gender': genders1
}

df3 = pd.DataFrame(data)